const types = {
    type: 'WORD_TEST',
    icon: 'https://creation.codemao.cn/716/appcraft/IMAGE_sjj6zqYwk_1657364324630.png',
    title: '敏感词检查',
    author: '刘lyxAndy',
    vaersion: 'V1.0.0-remake',
    isInvisibleWidget: true,
    isGlobalWidget: true,
    properties: [],
    methods: [
        {
            key: 'testString',
            label: '检查合规性',
            params: [
                {
                    key: 'msg',
                    label: '文本',
                    valueType: 'string',
                    defaultValue: '1145141919810lyxaiqyj',
                }
            ],
            valueType: 'string',
        }
    ],
    events: [],
}
class widget extends InvisibleWidget {
    constructor(props){
        super(props);
    };

    testString = (msg) =>{
        var sblst = ['你妈','你爸','你爷','傻逼','草你','艹你','你妈','你爸','你爷','傻逼','草你','艹你','操你妈','监狱','黑势力','拱白菜','打炮','买女人','买小孩','买孩子','黑社会','反动','工会','议会','卖淫','共党','耐操','军队','军火','抢劫','共匪','政府','狗官','国民党','民进党','反攻大陆','贿赂','腐败','贪污','共产党','斗争','阶级','强奸','睾丸','恋童癖','骚货','乳头','做爱','淫水','阴道','后入','奶子','自慰','口交','嫖娼','肛交','乳沟','性交','性爱','乳房','屌','约炮','阴茎','吸毒','发片','筘筘','脑残','加群','日赚','打字员','红包群','加Q','加q','包补','诚聘','代购','放心购买','QQ群发','有意私聊','接单','联系qq','任何费用','收徒','淘宝交易','招聘','要的加','低价','业务电话','工资日结','现金交易','代刷','返红包','业务QQ','代价','刷钻','刷赞','开钻','供货','招收','带价','免费兼职','赶快加入','如有打扰','提供货源','负责售后','火爆出售中','请+q','有需求的可以','的赚钱','寻大量','找代理','招代理','寻合作','欢迎联系','正规开票','群里不回','网赚','可购买','欢迎加盟','推荐奖金','刷Q','兼职','有需要','点击网址','有需要做','要求能上网','急聘','免费刷','包赚','群号码','要的联系','卡盟','加群','日赚','打字员','红包群','加Q','加q','包补','诚聘','代购','放心购买','QQ群发','有意私聊','接单','联系qq','任何费用','收徒','淘宝交易','招聘','要的加','低价','业务电话','工资日结','现金交易','代刷','返红包','业务QQ','代价','刷钻','刷赞','开钻','供货','招收','带价','免费兼职','赶快加入','如有打扰','提供货源','负责售后','火爆出售中','请+q','有需求的可以','的赚钱','寻大量','找代理','招代理','寻合作','欢迎联系','正规开票','群里不回','网赚','可购买','欢迎加盟','推荐奖金','刷Q','兼职','有需要','点击网址','有需要做','要求能上网','急聘','免费刷','包赚','群号码','要的联系','卡盟','扣扣','加裙','长按','长按识别','返佣','下单','网站','小号网','辅助网','出防','收益'];
        var kylst = [''];
        var flag = '0:正常'
        sblst.forEach((x)=>{
            if(msg.includes(x)){
                flag = '1:脏话暴力';
            }
        })
        //kylst.forEach((y)=>{
        //    if(msg.includes(y)){
        //        flag = '2:敏感信息';
        //    }
        //})
        return flag;
    }
}
exports.types = types;
exports.widget = widget;
